tutoratr4/app/controllers/courses_controller.rb

  def show
    @course = Course.find(params[:id], :conditions => "enabled = 't'")
---
SELECT * FROM "courses" WHERE ("courses"."id" = 1 AND (enabled = 't'))