tutoratr4/app/controllers/search_controller.rb

  def index
    query = params[:tutor][:name]

    @tutors = Tutor.find(:all, :select => "id, name",
      :conditions => ["enabled = 't' AND LOWER(name) LIKE ?", "%#{query}%"], :limit => 10)

    @courses = Course.find(:all, :select => "id, ('['||code||'] '||name) AS name",
      :conditions => ["enabled = 't' AND LOWER(name) LIKE ? OR LOWER(code) LIKE ?", "%#{query}%", "%#{query}%"], :limit => 10)
---
SELECT id, name FROM "tutors" WHERE (enabled = 't' AND LOWER(name) LIKE '%Profra Michele Adele Bell%') LIMIT 10
SELECT id, ('['||code||'] '||name) AS name FROM "courses" WHERE (enabled = 't' AND LOWER(name) LIKE '%Profra Michele Adele Bell%' OR LOWER(code) LIKE '%Profra Michele Adele Bell%') LIMIT 10