tutoratr4/app/controllers/tutors_controller.rb

  def show
    @tutor = Tutor.find(params[:id], :conditions => "enabled = 't'")
---
SELECT * FROM "tutors" WHERE ("tutors"."id" = 97 AND (enabled = 't'))